#Область ПрограммныйИнтерфейс

// процедура подготавливает пост запрпос для отправки сообщений и отправляет его
//
Процедура ВКМ_ОтправкаУведомленийТелеграмБоту() Экспорт 
	
	//Подготавливаем пост запрос для отправки сообщений 			
	ЗапросPOST = Неопределено;
	ИдентификаторГруппы = Неопределено;
	Соединение = Неопределено;
    ВКМ_ПоготовкаПОСТЗапроса(ЗапросPOST, ИдентификаторГруппы, Соединение);
	
	//проверяем наличие сообщений
	МассивСообщений = ПроверитьНаличиеУведомлений();
	Если МассивСообщений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Текст из МассивСообщений Цикл

	// Подготовили структуру сообщения 
	ТекстСообщения = Новый Структура; 
	ТекстСообщения.Вставить("chat_id",ИдентификаторГруппы);
	ТекстСообщения.Вставить("text",Текст);
	
	СообщениеJSON = ПростаяЗаписьJSON(ТекстСообщения);

	// Установили JSON строку полученную из структуры, в качестве тела HTTP-запроса	
	ЗапросPOST.УстановитьТелоИзСтроки(СообщениеJSON);
	
	// Отправили запрос методом POST 
	
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросPOST);
  	
	КодСостояния = Ответ.КодСостояния;
	
	Если КодСостояния = 200 Тогда
		УдалитьОтправленныеУведомления();	    
	Иначе
		ИиформацияОбОшибке = ИнформацияОбОшибке();

		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИиформацияОбОшибке));
	КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ПоготовкаПОСТЗапроса(ЗапросPOST, ИдентификаторГруппы, Соединение)
	
	ТокенБота = Константы.ВКМ_ТокенТелеграмБота.Получить();
	
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	//создали защищенное соединение  с сервером api.telegram.org
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	// создали запрос к боту через токен
	
	ТокенБота = Константы.ВКМ_ТокенТелеграмБота.Получить();
	ЧастиПутиКРесурсу = Новый Массив;
	ЧастиПутиКРесурсу.Добавить("/bot");
	ЧастиПутиКРесурсу.Добавить(ТокенБота);
	ЧастиПутиКРесурсу.Добавить("/sendMessage");
	
	ПутьКРесурсу = СтрСоединить(ЧастиПутиКРесурсу);	
	
	ЗапросPOST = Новый HTTPЗапрос(ПутьКРесурсу); 
	
	// добавили заголовок	
	ЗапросPOST.Заголовки.Вставить("Content-Type", "application/json");

КонецПроцедуры

Функция ПроверитьНаличиеУведомлений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Текст КАК Текст
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСообщений = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Текст = Выборка.Текст;
		МассивСообщений.Добавить(Текст);
	КонецЦикла;
	
	Возврат МассивСообщений;
	
КонецФункции

  
Функция ПростаяЗаписьJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();  
	
КонецФункции 


Процедура УдалитьОтправленныеУведомления()
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать(); //выбирает целиком элемент(не важно сколько в нем реквизитов), строку в форме списка!
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементСправочника = Выборка.ПолучитьОбъект();// с элементами справочника работаем через объект, через ссылку нельзя.
		ЭлементСправочника.Удалить();
		
	КонецЦикла;
  	
КонецПроцедуры  
 
#КонецОбласти 


