#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура  создает уведомление для телеграмм бота если в меняются данные в справочнике ВКМ_УведомленияТелеграмБоту
// Параметры:
//  ТекстУведомления - Строка - текст сообщения.
//  
Процедура СоздатьУведомлениеТГБоту(ТекстУведомления) Экспорт
 		
	УведомлениеТГБоту = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	УведомлениеТГБоту.Текст = ТекстУведомления;
	УведомлениеТГБоту.Записать(); 
	
	ОбщегоНазначения.СообщитьПользователю("Уведомление для телеграм-бота создано."); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
	Если Данные.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ОбщегоНазначения.СообщитьПользователю("Выберите договор с абонентской платой");
		Отказ = Истина;
	КонецЕсли;
	Если Дата < Данные.ВКМ_ДатаНачалаДействияДоговора Или Дата > Данные.ВКМ_ДатаОкончанияДействияДоговора Тогда
		ОбщегоНазначения.СообщитьПользователю("Дата документа вне срока дествия договора");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
		

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплате
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиента.Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРаботы КАК ПроцентОтРаботы
	|ПОМЕСТИТЬ ВТ_УслолвияОплаты
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Специалист) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.ЧасыКОплате КАК ЧасыКОплате,
	|   ВТ_ДанныеДокумента.СтоимостьЧасаРаботы,
	|	ВТ_УслолвияОплаты.ПроцентОтРаботы КАК ПроцентОтРаботы
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслолвияОплаты КАК ВТ_УслолвияОплаты
	|		ПО ВТ_ДанныеДокумента.Специалист = ВТ_УслолвияОплаты.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
			
	Выборка = Запрос.Выполнить().Выбрать();
	 	
	Пока Выборка.Следующий() Цикл 
					
		Если Выборка.ПроцентОтРаботы = Null Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				"Сотруднику %1 не указан процент от работ в условиях оплаты.", Специалист));
			Отказ = Истина;
			Возврат;
		Иначе
		
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплате;
			Движение.СуммаКОплате = Выборка.ЧасыКОплате * Выборка.СтоимостьЧасаРаботы;
				
			//регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
        	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Специалист;
			Движение.ЧасовКОплате = Выборка.ЧасыКОплате;
			Движение.СуммаКОплате = (Выборка.ЧасыКОплате * Выборка.СтоимостьЧасаРаботы * Выборка.ПроцентОтРаботы) / 100;
		КонецЕсли;
		
	КонецЦикла;		
												
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
КонецПроцедуры 


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстУведомления = СтрШаблон("Новая заявка %1 от %2 для %3. К работе приступить %4 в %5 ", Клиент, Формат(Дата, "ДЛФ=D"), Специалист,
	Формат(ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(ВремяНачалаРаботПлан,"ДЛФ=T"));
	
	Если ЭтоНовый() Тогда
		
		СоздатьУведомлениеТГБоту(ТекстУведомления);	
			
	КонецЕсли; 
	 	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
