
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание; 
	
	// {{ Исакова О.С. Изменение заполнения суммы отгрузки в зависимости от вида договора.
	
	//изначальный вариант кода
	
	//Движение.СуммаОтгрузки = СуммаДокумента;
	
	//измененный вариант кода
	
	АбоненскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Номенклатура = ВКМ_НоменклатураРаботыСпециалиста.Значение
	|				ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|		КОНЕЦ) КАК СуммаВыполненныхРабот
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги,
	|	Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Ссылка.Договор";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если НЕ Договор.ВидДоговора = АбоненскоеОбслуживание Тогда
			Движение.СуммаОтгрузки = СуммаДокумента;
		Иначе 	
			Движение.СуммаОтгрузки = Выборка.СуммаВыполненныхРабот;
		КонецЕсли;
	КонецЦикла;
	// }}
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

// {{ Исакова О.С. Добавление экспортной процедуры Выполнить автозаполнение, которая заполняеет ТЧ Услуги Документа Реализация товаров и услуг.

Процедура ВКМ_ВыполнитьАвтозаполнение()Экспорт
	
	АбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(АбонентскаяПлата)ИЛИ Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Константы: Номенклатура-абонентская плата и Номенклатура-работы специалиста должны быть заполнены.");
		Возврат;
		
	КонецЕсли;
	
	// очистим табличную часть Услуги,
	
	ЭтотОбъект.Услуги.Очистить();
	
	//Если в договоре ненулевая сумма абонентской платы, 
	//добавляем в ТЧ Услуги строку с номенклатурой из константы номенклатура абонентская плата
	//и суммой абонентской платы из договора
	
	РазмерАбонентскойПлаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_РазмерАбонентскойПлаты");
	
	Если РазмерАбонентскойПлаты > 0 Тогда

		СтрокаАбонПлата = ЭтотОбъект.Услуги.Добавить();
		СтрокаАбонПлата.Номенклатура = АбонентскаяПлата;
		СтрокаАбонПлата.Количество = 1;
		СтрокаАбонПлата.Цена = РазмерАбонентскойПлаты;
		СтрокаАбонПлата.Сумма = СтрокаАбонПлата.Количество * СтрокаАбонПлата.Цена; 
		
	КонецЕсли;
    			
	//Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы
	//есть информация о выполненных работах по этому договору, 
	//то в ТЧ добавится строку с номенклатурой из константы НоменклатураРаботыСпециалиста
	//и общим количеством и суммой из регистра ВыполненныеКлиентуРаботы за месяц документа
	
	МесяцДатыДокумента = Месяц(Дата);

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК КоличествоЧасов,
	|	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК СуммаКОплате,
	|	МЕСЯЦ(ВКМ_ВыполненныеКлиентуРаботы.Период) КАК ПериодМесяц
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВКМ_ВыполненныеКлиентуРаботы.Договор = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	МЕСЯЦ(ВКМ_ВыполненныеКлиентуРаботы.Период)";
	
	Запрос.УстановитьПараметр("Договор", Договор);                        
	
	Результат = Запрос.Выполнить();
	ВыборкаРаботы = Результат.Выбрать();
			
	Пока ВыборкаРаботы.Следующий() Цикл
										
			Если ВыборкаРаботы.ПериодМесяц = МесяцДатыДокумента Тогда
				СтрокаРаботы = ЭтотОбъект.Услуги.Добавить();
				СтрокаРаботы.Номенклатура = РаботыСпециалиста;
				СтрокаРаботы.Количество = ВыборкаРаботы.КоличествоЧасов;
				СтрокаРаботы.Цена = ВыборкаРаботы.СуммаКОплате / ВыборкаРаботы.КоличествоЧасов;
				СтрокаРаботы.Сумма = СтрокаРаботы.Количество * СтрокаРаботы.Цена ;
			КонецЕсли;
		
		КонецЦикла;
			
КонецПроцедуры
// }}
#КонецОбласти

#КонецЕсли
