#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	
	РассчитатьОклад();
	РассчитьтьОтпуск();
	РассчитатьУдержания();
	
	ДвиженияВзаиморасчетыССотрудниками();
	ДвиженияУчетОтпускаСотрудников();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Строка Из ЗарплатаНачисленная Цикл
		Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке №%1 дата начала больше даты окончания",
			Строка.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке №%1 не верный вид расчета", Строка.НомерСтроки));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ЗарплатаНачисленная КАК ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаНачала,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаОкончания,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот
	|ПОМЕСТИТЬ ВТ_ВыполненныеРаботы
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРаботы КАК ПроцентОтРаботы
	|ПОМЕСТИТЬ ВТ_Процент
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	|	ВТ_ДанныеДокумента.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеДокумента.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДанныеДокумента.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_Процент.ПроцентОтРаботы КАК ПроцентОтРаботы,
	|	ВТ_ВыполненныеРаботы.СуммаКОплатеОборот КАК СуммаКОплате
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполненныеРаботы КАК ВТ_ВыполненныеРаботы
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ВыполненныеРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Процент КАК ВТ_Процент
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_Процент.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Движение.ПериодДействияНачало = Выборка.ДатаНачала;
			Движение.ПериодДействияКонец = Выборка.ДатаОкончания;
			Движение.ВидРасчета = Выборка.ВидРасчета;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.ГрафикРаботы = Выборка.ГрафикРаботы;
			
			Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Выборка.ДатаНачала, -12));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Выборка.ДатаОкончания, -1));
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Движение.ВидРасчета = Выборка.ВидРасчета;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.ПроцентПремии = Выборка.ПроцентОтРаботы;
			Движение.Результат = Выборка.СуммаКОплате;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДвиженияУдержания();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ЗарплатаНачисленная КАК ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЧасовВДеньПериодДействия, 0) КАК План,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЧасовВДеньФактическийПериодДействия, 0) КАК Факт,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&Период,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
	|					ИЗ
	|						РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|					ГДЕ
	|						ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|						И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.План = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнен график работы");
			Прервать;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.Оклад * Выборка.Факт / Выборка.План;
		Движение.ОтработаноЧасов = Выборка.Факт;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
	
КонецПроцедуры

Процедура РассчитьтьОтпуск()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК ДополнительныйРезультатБаза,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК ОсновнойРезультатБаза,
	               |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноЧасовБаза, 0) КАК ОтработаноЧасовБаза,
	               |	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	               |	ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
	               |				&Измерения,
	               |				&Измерения,
	               |				,
	               |				Регистратор = &Ссылка
	               |					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
	               |		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	               |				&Измерения,
	               |				&Измерения,
	               |				,
	               |				Регистратор = &Ссылка
	               |					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	               |		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск
	               |	И ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		ДнейОтработано = Выборка.ОтработаноЧасовБаза / 8;
		ДнейОтпуска = (НачалоДня(Выборка.ПериодДействияКонец) - НачалоДня(Выборка.ПериодДействияНачало)) / 86400; // секунд в сутки 60*60*24
		Движение.Результат = (Выборка.ОсновнойРезультатБаза + Выборка.ДополнительныйРезультатБаза) / ДнейОтработано * ДнейОтпуска;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
	
КонецПроцедуры

Процедура РассчитатьУдержания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК ОсновнойРезультатБаза
	|ПОМЕСТИТЬ ВТ_ОсновныеУдержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				&Разрезы,
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &ВидРасчета) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Регистратор
	|	И ВКМ_Удержания.ВидРасчета = &ВидРасчета
	|	И ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РегистраторРазрез = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
	|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК ДополнительныйРезультатБаза
	|ПОМЕСТИТЬ ВТ_ДополнительныеУдержания
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				&Разрезы,
	|				Регистратор = &Регистратор
	|					И ВидРасчета = &ВидРасчета) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Регистратор
	|	И ВКМ_Удержания.ВидРасчета = &ВидРасчета
	|	И ТИПЗНАЧЕНИЯ(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез) <> ТИП(Документ.ВКМ_НачислениеФиксированныхПремий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеУдержания.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_ОсновныеУдержания.ОсновнойРезультатБаза, 0) КАК ОсновнойРезультатБаза,
	|	ЕСТЬNULL(ВТ_ДополнительныеУдержания.ДополнительныйРезультатБаза, 0) КАК ДополнительныйРезультатБаза
	|ИЗ
	|	ВТ_ОсновныеУдержания КАК ВТ_ОсновныеУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеУдержания КАК ВТ_ДополнительныеУдержания
	|		ПО ВТ_ОсновныеУдержания.НомерСтроки = ВТ_ДополнительныеУдержания.НомерСтроки";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Разрезы = Новый Массив;
	Разрезы.Добавить("Регистратор");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Разрезы", Разрезы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = (Выборка.ОсновнойРезультатБаза + Выборка.ДополнительныйРезультатБаза) * 13 / 100;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать( , Истина);
	
КонецПроцедуры

Процедура ДвиженияВзаиморасчетыССотрудниками()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК ОснСотрудник,
	|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК ОснРезультат,
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета
	|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисления.Сотрудник,
	|	ВКМ_ОсновныеНачисления.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК ДопСотрудник,
	|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК ДопРезультат,
	|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ДополнительныеНачисления.Сотрудник,
	|	ВКМ_ДополнительныеНачисления.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник КАК Сотрудник,
	|	ВТ_ДополнительныеНачисления.ДопРезультат КАК ДопРезультат,
	|	ВТ_ОсновныеНачисления.ОснРезультат КАК ОснРезультат,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ЗарплатаНачисленная КАК ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
	|		ПО (ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник = ВТ_ОсновныеНачисления.ОснСотрудник
	|		И ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета = ВТ_ОсновныеНачисления.ВидРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
	|		ПО (ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник = ВТ_ДополнительныеНачисления.ДопСотрудник
	|		И ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета = ВТ_ДополнительныеНачисления.ВидРасчета)
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Ссылка = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = Выборка.ВидРасчета; 
		
		Если Выборка.ОснРезультат = Null Тогда
			Движение.Сумма = Выборка.ДопРезультат * 87 / 100;
		Иначе
			Движение.Сумма = Выборка.ОснРезультат * 87 / 100;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвиженияУчетОтпускаСотрудников() 
	
	Движения.ВКМ_УчетОтпусков.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаНачала,
	|		ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДней
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ЗарплатаНачисленная КАК ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗаработнойПлатыЗарплатаНачисленная.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_УчетОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
		Движение.Период = Выборка.ДатаОкончания;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Значение = Выборка.КоличествоДней;
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли