#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

 &НаСервере
 Процедура СпециалистПриИзмененииНаСервере()
	 
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменена. Отвественным назначен %3. К работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));

	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПроведенияРаботПриИзмененииНаСервере()
	
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменена дата оказания услуги. %3 к работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления); 
	
КонецПроцедуры

&НаСервере
Процедура ВремяНачалаРаботПланПриИзмененииНаСервере() 
	
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменено время оказания услуги. %3 к работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		СпециалистПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте

Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		ДатаПроведенияРаботПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПланПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		ВремяНачалаРаботПланПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры  

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
