#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция МассовоеСозданиеДокументаРеализация(Период) Экспорт
	
	ДатаНачала = Период.ДатаНачала;
	МесяцПериода = Месяц(ДатаНачала);
	ДатаДокумента = Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("ПустаяДата",'00010101');
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Клиент,
	|	ДоговорыКонтрагентов.ВКМ_РазмерАбонентскойПлаты КАК СуммаДоговора,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговорыАбоненскоеОбслуживание
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Дата КАК ДатаПроведенияРабот,
	|	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ОбслуживаниеКлиента
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ДоговорыАбоненскоеОбслуживание.СуммаДоговора) КАК СуммаДоговора,
	|	ВТ_ДоговорыАбоненскоеОбслуживание.Организация КАК Организация,
	|	ВТ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВТ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) КАК ДатаПроведенияРабот,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) = ЕСТЬNULL(МЕСЯЦ(РеализацияТоваровУслуг.Дата), &ПустаяДата)
	|			ТОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот)
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК МесяцДокументаРеализация
	|ИЗ
	|	ВТ_ОбслуживаниеКлиента КАК ВТ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыАбоненскоеОбслуживание КАК ВТ_ДоговорыАбоненскоеОбслуживание
	|		ПО ВТ_ОбслуживаниеКлиента.Договор = ВТ_ДоговорыАбоненскоеОбслуживание.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоговорыАбоненскоеОбслуживание.Организация,
	|	ВТ_ОбслуживаниеКлиента.Клиент,
	|	ВТ_ОбслуживаниеКлиента.Договор,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот) = ЕСТЬNULL(МЕСЯЦ(РеализацияТоваровУслуг.Дата), &ПустаяДата)
	|			ТОГДА МЕСЯЦ(ВТ_ОбслуживаниеКлиента.ДатаПроведенияРабот)
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	СозданныеДокументы = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.МесяцДокументаРеализация = МесяцПериода Тогда
			
			Продолжить; 
			
		ИначеЕсли Выборка.МесяцДокументаРеализация = '00010101' Тогда
			
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Дата = ДатаДокумента; 
			ДокументРеализация.Организация = Выборка.Организация; 
			ДокументРеализация.Контрагент = Выборка.Клиент;
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.Ответственный = Пользователи.ТекущийПользователь(); 
			ДокументРеализация.Комментарий = "Созданно автоматически";
			ДокументРеализация.Заполнить(Неопределено);//вызываем стандартный алгоритм заполнения
	       	ДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
			ДокументРеализация.ПроверитьЗаполнение();//вызываем стандартный алгоритм проверки заполнения 	
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			СозданныеДокументы.Добавить(ДокументРеализация.Ссылка); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СозданныеДокументы; 
	
КонецФункции

#КонецОбласти

#КонецЕсли  	
	
	