
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	
	ЗаполнитьГрафикНаСервере(); 
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "График заполнен!";
	Сообщение.Сообщить();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВКМ_ЗаполнитьГрафикРаботы(Период.ДатаНачала, Период.ДатаОкончания, Выходные);
КонецПроцедуры

#КонецОбласти