#Область ОбработчикиСобытийФормы

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	 // {{ Исакова О.С. Добавление реквизитов в форму элемента справочника ДоговорыКонтрагентов, при условии
	 
	 ВКМ_ДобавлениеРеквизитов();
	 
	 Если Объект.ВидДоговора = Неопределено ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Покупатель
		 ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Поставщик Тогда
		 
		 Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		 Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
		 Элементы.РазмерАбонентскойПлаты.Видимость = Ложь;
		 Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		 
	 Иначе
		 
		 Элементы.ДатаНачалаДействияДоговора.Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
		 Элементы.ДатаОкончанияДействияДоговора.Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
		 Элементы.РазмерАбонентскойПлаты.Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
		 Элементы.СтоимостьЧасаРаботы.Видимость = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
		 
	 КонецЕсли;
	 
	 Элементы.ВидДоговора.УстановитьДействие("ПриИзменении","ВидДоговораПриИзменении");
	 
	 // }}
	 
 КонецПроцедуры
  				
 #КонецОбласти 
 
 #Область СлужебныеПроцедурыИФункции
 &НаСервере
 Процедура ВКМ_ДобавлениеРеквизитов()
	 // {{ Исакова О.С. Добавление реквизитов в форму элемента справочника ДоговорыКонтрагентов.
	 	 
	 ПолеДатаНачалаДействияДоговора = Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	 ПолеДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	 
	 ПолеДатаОкончанияДействияДоговора = Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	 ПолеДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	 
	 ПолеРазмерАбонентскойПлаты = Элементы.Добавить("РазмерАбонентскойПлаты", Тип("ПолеФормы"));
	 ПолеРазмерАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеРазмерАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_РазмерАбонентскойПлаты";
	 
	 ПолеСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	 ПолеСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
     // }}

 КонецПроцедуры 
 
 &НаКлиенте
 Процедура ВидДоговораПриИзменении (Элемент)
	 
	 // {{ Исакова О.С. Меняем открытую форму.
	 
	 Если Объект.ВидДоговора = Неопределено ИЛИ Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Покупатель")
		 ИЛИ Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Поставщик") Тогда
		 
		 Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		 Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
		 Элементы.РазмерАбонентскойПлаты.Видимость = Ложь;
		 Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		 
	 Иначе
		 
		 Элементы.ДатаНачалаДействияДоговора.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		 Элементы.ДатаОкончанияДействияДоговора.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		 Элементы.РазмерАбонентскойПлаты.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		 Элементы.СтоимостьЧасаРаботы.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		 
	 КонецЕсли;
	 
	 ЭтаФорма.Прочитать();
	 
	 ЭтаФорма.ОбновитьОтображениеДанных();
	 
	 // }}
 
КонецПроцедуры
 
 #КонецОбласти 