
#Область ОбработчикиКомандФормы	

&НаКлиенте
Процедура МассовоеСозданиеРеализаций(Команда)
	
	
	ДлительнаяОперация = МассовоеСозданиеРеализацийНаСервереФункция();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);	
	ОповещениеОВыполнении = Новый ОписаниеОповещения("ОповещениеОВыполнении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,ОповещениеОВыполнении,ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МассовоеСозданиеРеализацийНаСервереФункция()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
	"Обработки.ВКМ_МассовоеСозданиеАктов.МассовоеСозданиеДокументаРеализация",Период); 
	Возврат ДлительнаяОперация; 
	
КонецФункции 

&НаКлиенте
Процедура ОповещениеОВыполнении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли; 
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		Возврат
	КонецЕсли; 
	
	СозданныеДокументы = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	ЗаполнитьСписокДоговоровИРеализаций(СозданныеДокументы);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокДоговоровИРеализаций(СозданныеДокументы)
	
	Для каждого Документ из СозданныеДокументы Цикл
		
		Строка = Объект.СписокДоговоровИРеализаций.Добавить();
		Строка.Контрагент = Документ.Контрагент;
		Строка.Договор = Документ.Договор;
		Строка.ДокументРеализация = Документ.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

